Задача 1
a = int(input("Введите число: "))
for i in range(1, a + 1):
    print(i)
Задача 2
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
if num1 > num2:
    print("Больше число:", num1)
else:
    print("Больше число:", num2)





